@anton-sidelnikov thank you so much

- If `os_scheduler_hints {}` is missing in the script, Terraform tries replacing the ECS instance over and over again. 
- But documentation says `os_scheduler_hints {}` is optional
- adding `os_scheduler_hints {}` ends this behavior

```
  # module.bastion.opentelekomcloud_ecs_instance_v1.linuxbox must be replaced
-/+ resource "opentelekomcloud_ecs_instance_v1" "linuxbox" {
      ~ auto_recovery               = true -> (known after apply)
      ~ id                          = "10c2c432-***" -> (known after apply)
        name                        = "skoban-th-bastion"
      ~ system_disk_id              = "e5272c56-***" -> (known after apply)
        tags                        = {
            "Environment" = "bar"
            "Terraform"   = "True"
        }
      ~ volumes_attached            = [] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ nics {
          ~ mac_address = "fa:**:3e:**:6d:**" -> (known after apply)
          ~ port_id     = "03288b25-***" -> (known after apply)
          ~ type        = "fixed" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - os_scheduler_hints {} # forces replacement
    }

```